# SQLAlchemy: SQL and ORM

We will follow a series of exercises to get familiar with SQL and ORM.

ORM can be an abstract concept, to help you compare, the exercises will be a combination of traditional queries and SQLAlchemy queries.

`SQLAlchemy` is the Python SQL toolkit and Object Relational Mapper that gives application developers the full power and flexibility of SQL.

It provides a full suite of well known enterprise-level persistence patterns, designed for efficient and high-performing database access, adapted into a simple and Pythonic domain language.

Installing The Package:

```pip install sqlalchemy```

## Setting up your notebook
To facilitate developing, you can run this notebook on a [Google Colab](https://colab.research.google.com/).

In [50]:
# Load the SQL magic extension
# https://github.com/ploomber/jupysql
# this extension allows us to connect to DBs and issue SQL commands
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [ ]:
# To run SQL code in a Jupyter notebook cell, you can use the magic command %%sql

In [51]:
%%sql
SELECT sqlite_version();

 * sqlite:///MyDataBase.db
Done.

[('3.43.1',)]

After running the previous cell, we encounter the error `UsageError: No active connection.` This is due to the fact a connection with a database has not been established.

## Create a database with SQL Alchemy

The ***Declarative Mapping*** is the typical way that mappings are constructed in modern SQLAlchemy. Read more: [Declarative mapping and alternatives](https://docs.sqlalchemy.org/en/14/orm/mapping_styles.html#orm-declarative-mapping).

In [52]:
from sqlalchemy import Column, Integer, String, ForeignKey
from sqlalchemy.orm import declarative_base
from sqlalchemy import create_engine
from sqlalchemy.orm import sessionmaker

# declarative base class
Base = declarative_base()

# an example mapping using the base
class User(Base):
    __tablename__ = 'user'

    id = Column(Integer, primary_key=True)
    name = Column(String)
    fullname = Column(String)
    nickname = Column(String)

The `Engine` is the starting point for any SQLAlchemy application, it represents a Python object that can be used to interact directly with the database and can be passed to a Session object to work with the ORM,

The `create_engine()`  function produces an `Engine` object based on a URL.

In [53]:
engine = create_engine('sqlite:///MyDataBase.db')

*Note the use of `///` to indicate a relative file path.*

In [54]:
print(type(engine))

<class 'sqlalchemy.engine.base.Engine'>

The typical form of a database URL is:
`dialect+driver://username:password@host:port/database`

In this case we are using [SQLite](https://www.sqlite.org/index.html) a database engine broadly used worldwide for desktop and mobile aplications and provides the advantage of containing the database into one file `DB.db`.

Among the supported databases on sql alchemy we can list:

- SQLite
- PosgreSQL
- MySQL
- Oracle
- Microsoft SQL Server

The `Table object` is a member of a larger collection known as `MetaData`. When using Declarative, this object is available using the `.metadata attribute` of our declarative base class.

The `MetaData` is a registry which includes the ability to emit a limited set of schema generation commands to the database. As our database does not actually have a users table present, we can use `MetaData` to issue CREATE TABLE statements to the database for all tables that donâ€™t yet exist.

In [55]:
# Create database following parameters defined in `Base`
Base.metadata.create_all(engine)

Refresh local files of your working directory, now you should be able to see the file `MyDataBase.db`.

In [56]:
# Connecting to the database
%sql sqlite:///MyDataBase.db

In [58]:
%%sql
-- # In SQL the comments are declared with --
-- # Example: Query to select values on table "user" from MyDataBase.db
SELECT * FROM user;

 * sqlite:///MyDataBase.db
Done.

[(1, 'Arnold', 'Arnold Schwarzenegger', 'Terminator'),
 (2, 'Jennifer', 'Jennifer Aniston', 'Rachel'),
 (3, 'Tyrannosaurus', 'Tyrannosaurus Rex', 'T-Rex'),
 (4, 'Neil', 'Neil Patrick Harris', 'Barney Stinson'),
 (5, 'Aegon', 'Aegon Targaryen', 'John Snow'),
 (6, 'Alice', 'Alice Wonderland', 'Ally'),
 (7, 'Bob', 'Bob Builder', 'Bobby'),
 (8, 'Charlie', 'Charlie Brown', 'Chuck'),
 (9, 'David', 'David Beckham', 'Dave'),
 (10, 'Eva', 'Eva Green', 'Evie'),
 (11, 'Frank', 'Frank Sinatra', 'Frankie'),
 (12, 'Grace', 'Grace Kelly', 'Gracie'),
 (13, 'Hannah', 'Hannah Montana', 'Hanny'),
 (14, 'Ivy', 'Ivy League', 'Ives'),
 (15, 'Jack', 'Jack Sparrow', 'Jackie'),
 (16, 'Arnold', 'Arnold Schwarzenegger', 'Terminator')]

The table `user` declared previously on `class User(Base)` exist on the database but no data has been stored yet.

# Database sessions

A `DBSession()` instance establishes all conversations with the database during your session. 
- Any change made against the objects in the session won't be persisted into the database until you call: `session.commit()`. *(just like using Git...)*

- If you're not happy about the changes, you can revert all of them back to the last commit by calling `session.rollback()`.

In [45]:
# Bind the engine to the metadata of the Base class so that the
# declaratives can be accessed through a DBSession instance
Base.metadata.bind = engine
DBSession = sessionmaker(bind=engine)
session = DBSession()

## Insert information into table *ORM approach*

In [46]:
# Using `class User(Base)` to input new parameters into the table `user`
my_first_table = User(name="Arnold", fullname="Arnold Schwarzenegger", nickname="Terminator")

In [47]:
# Add and commit changes to table `user`
session.add(my_first_table)
session.commit()
print(my_first_table)

<__main__.User object at 0x11a62e4d0>

`my_first_table` is a Python object, what means we can interact with the table in the same way done with other functions:

In [49]:
print(my_first_table.id)
print(my_first_table.name)
print(my_first_table.fullname)
print(my_first_table.nickname)

16
Arnold
Arnold Schwarzenegger
Terminator

## Insert information to table *using Queries*

Instead of using `class User(Base)`, we will add the values to the table using directly SQL queries. This, with the purpose of ilustrate with a pragmatical example the working methods using ORM vs SQL queries.

In [18]:
%%sql

-- # Insert values into the table `user`

INSERT INTO user(id, name, fullname, nickname)
    VALUES (2, 'Jennifer', 'Jennifer Aniston', 'Rachel'), 
    (3, 'Tyrannosaurus','Tyrannosaurus Rex', 'T-Rex'), 
    (4, 'Neil', 'Neil Patrick Harris', 'Barney Stinson'),
    (5, 'Aegon', 'Aegon Targaryen', 'John Snow');

 * sqlite:///MyDataBase.db
4 rows affected.

[]

To check your information was inserted correctly you can open your database or use one of the many VSCode extentions to view SQLite databases (e.g. SQL Viewer).

## Exercises: 

1. Use the `class User` to insert 5 rows of data into the table `user`
2. Insert 5 additional rows but this time using queries

In [19]:
## Your code: ORM Approach
users = [
    User(name='Alice', fullname='Alice Wonderland', nickname='Ally'),
    User(name='Bob', fullname='Bob Builder', nickname='Bobby'),
    User(name='Charlie', fullname='Charlie Brown', nickname='Chuck'),
    User(name='David', fullname='David Beckham', nickname='Dave'),
    User(name='Eva', fullname='Eva Green', nickname='Evie')
]

# Add users to the session
session.add_all(users)

# Commit the transaction to the database
session.commit()

In [20]:
%%sql

--# Your code: Using SQL Queries
INSERT INTO user (name, fullname, nickname) 
    VALUES
    ('Frank', 'Frank Sinatra', 'Frankie'),
    ('Grace', 'Grace Kelly', 'Gracie'),
    ('Hannah', 'Hannah Montana', 'Hanny'),
    ('Ivy', 'Ivy League', 'Ives'),
    ('Jack', 'Jack Sparrow', 'Jackie');

 * sqlite:///MyDataBase.db
5 rows affected.

[]

## Preview values in table

You can also preview the values in a particular table by using queries and the ORM approach.

### *Using queries:*

In [21]:
%%sql

SELECT * FROM user;

 * sqlite:///MyDataBase.db
Done.

[(1, 'Arnold', 'Arnold Schwarzenegger', 'Terminator'),
 (2, 'Jennifer', 'Jennifer Aniston', 'Rachel'),
 (3, 'Tyrannosaurus', 'Tyrannosaurus Rex', 'T-Rex'),
 (4, 'Neil', 'Neil Patrick Harris', 'Barney Stinson'),
 (5, 'Aegon', 'Aegon Targaryen', 'John Snow'),
 (6, 'Alice', 'Alice Wonderland', 'Ally'),
 (7, 'Bob', 'Bob Builder', 'Bobby'),
 (8, 'Charlie', 'Charlie Brown', 'Chuck'),
 (9, 'David', 'David Beckham', 'Dave'),
 (10, 'Eva', 'Eva Green', 'Evie'),
 (11, 'Frank', 'Frank Sinatra', 'Frankie'),
 (12, 'Grace', 'Grace Kelly', 'Gracie'),
 (13, 'Hannah', 'Hannah Montana', 'Hanny'),
 (14, 'Ivy', 'Ivy League', 'Ives'),
 (15, 'Jack', 'Jack Sparrow', 'Jackie')]

### *ORM approach*:

The inspection module provides the `inspect()` function, which delivers runtime information about a wide variety of SQLAlchemy objects, both within the Core as well as the ORM.

The `inspect()` function is the entry point to SQLAlchemyâ€™s public API for viewing the configuration and construction of in-memory objects. Read more: https://docs.sqlalchemy.org/en/20/core/inspection.html.

In [ ]:
from sqlalchemy import inspect
inspector = inspect(engine)

# Get table information
print(inspector.get_table_names())

In [ ]:
# Get values in table:

print("----> User by (name):")
query = session.query(User)
for _row in query.all():
    print(_row.id, _row.name, _row.fullname, _row.nickname)

### Exercises: 

1. Modify the code of the previous cell to stored the printed values on:

    a. A pandas DataFrame
    
    b. A dictionary

In [23]:
import pandas as pd
# Query all users to verify
all_users = session.query(User).all()

# Convert query results to a list of dictionaries
user_data = [
    {
        "ID": user.id,
        "Name": user.name,
        "Full Name": user.fullname,
        "Nickname": user.nickname
    }
    for user in all_users
]

# Create a Pandas DataFrame from the list of dictionaries
df_users = pd.DataFrame(user_data)

# Print DataFrame
print("DataFrame:")
print(df_users)

DataFrame:
    ID           Name              Full Name        Nickname
0    1         Arnold  Arnold Schwarzenegger      Terminator
1    2       Jennifer       Jennifer Aniston          Rachel
2    3  Tyrannosaurus      Tyrannosaurus Rex           T-Rex
3    4           Neil    Neil Patrick Harris  Barney Stinson
4    5          Aegon        Aegon Targaryen       John Snow
5    6          Alice       Alice Wonderland            Ally
6    7            Bob            Bob Builder           Bobby
7    8        Charlie          Charlie Brown           Chuck
8    9          David          David Beckham            Dave
9   10            Eva              Eva Green            Evie
10  11          Frank          Frank Sinatra         Frankie
11  12          Grace            Grace Kelly          Gracie
12  13         Hannah         Hannah Montana           Hanny
13  14            Ivy             Ivy League            Ives
14  15           Jack           Jack Sparrow          Jackie

In [24]:
# Convert list of dictionaries to a dictionary with IDs as keys
user_dict = {user["ID"]: user for user in user_data}

# Print dictionary
print("\nDictionary:")
print(user_dict)

Dictionary:
{1: {'ID': 1, 'Name': 'Arnold', 'Full Name': 'Arnold Schwarzenegger', 'Nickname': 'Terminator'}, 2: {'ID': 2, 'Name': 'Jennifer', 'Full Name': 'Jennifer Aniston', 'Nickname': 'Rachel'}, 3: {'ID': 3, 'Name': 'Tyrannosaurus', 'Full Name': 'Tyrannosaurus Rex', 'Nickname': 'T-Rex'}, 4: {'ID': 4, 'Name': 'Neil', 'Full Name': 'Neil Patrick Harris', 'Nickname': 'Barney Stinson'}, 5: {'ID': 5, 'Name': 'Aegon', 'Full Name': 'Aegon Targaryen', 'Nickname': 'John Snow'}, 6: {'ID': 6, 'Name': 'Alice', 'Full Name': 'Alice Wonderland', 'Nickname': 'Ally'}, 7: {'ID': 7, 'Name': 'Bob', 'Full Name': 'Bob Builder', 'Nickname': 'Bobby'}, 8: {'ID': 8, 'Name': 'Charlie', 'Full Name': 'Charlie Brown', 'Nickname': 'Chuck'}, 9: {'ID': 9, 'Name': 'David', 'Full Name': 'David Beckham', 'Nickname': 'Dave'}, 10: {'ID': 10, 'Name': 'Eva', 'Full Name': 'Eva Green', 'Nickname': 'Evie'}, 11: {'ID': 11, 'Name': 'Frank', 'Full Name': 'Frank Sinatra', 'Nickname': 'Frankie'}, 12: {'ID': 12, 'Name': 'Grace', 'Full Name': 'Grace Kelly', 'Nickname': 'Gracie'}, 13: {'ID': 13, 'Name': 'Hannah', 'Full Name': 'Hannah Montana', 'Nickname': 'Hanny'}, 14: {'ID': 14, 'Name': 'Ivy', 'Full Name': 'Ivy League', 'Nickname': 'Ives'}, 15: {'ID': 15, 'Name': 'Jack', 'Full Name': 'Jack Sparrow', 'Nickname': 'Jackie'}}

2. Insert new table using queries

In [31]:
%%sql

CREATE TABLE media (
    id          INTEGER PRIMARY KEY NOT NULL,
    production  TEXT NOT NULL,
    year        NUMBER NOT NULL
    );

 * sqlite:///MyDataBase.db
(sqlite3.OperationalError) table media already exists
[SQL: CREATE TABLE media (
    id          INTEGER PRIMARY KEY NOT NULL,
    production  TEXT NOT NULL,
    year        NUMBER NOT NULL
    );]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [35]:
%%sql
--# Insert values on table `media`
INSERT INTO media(id, production, year)
    VALUES (1,'Terminator',1984), 
    (2,'Friends', 1994), 
    (3,'Toy Story', 1995), 
    (4,'How I met your mother', 2005),
    (5,'Game of thrones',2011);

 * sqlite:///MyDataBase.db
(sqlite3.IntegrityError) UNIQUE constraint failed: media.id
[SQL: --# Insert values on table `media`
INSERT INTO media(id, production, year)
    VALUES (1,'Terminator',1984),
    (2,'Friends', 1994),
    (3,'Toy Story', 1995),
    (4,'How I met your mother', 2005),
    (5,'Game of thrones',2011);]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

In [59]:
%%sql

SELECT * FROM media;

 * sqlite:///MyDataBase.db
Done.

[(1, 'Terminator', 1984),
 (2, 'Friends', 1994),
 (3, 'Toy Story', 1995),
 (4, 'How I met your mother', 2005),
 (5, 'Game of thrones', 2011)]

3. Complete the values on the table `media` that corresponds to your previous inputs on the table `user`.

In [60]:
# Awesome code
%%sql

INSERT INTO media(id, production, year)
    VALUES (6, 'Alice Wonderland', 2023),  
    (7, 'Bob Builder', 2024),       
    (8, 'Charlie Brown', 2025),      
    (9, 'David Beckham', 2026),      
    (10, 'Eva Green', 2027),         
    (11, 'Frank Sinatra', 2028),     
    (12, 'Grace Kelly', 2029),       
    (13, 'Hannah Montana', 2030),   
    (14, 'Ivy League', 2031),        
    (15, 'Jack Sparrow', 2032);

SyntaxError: invalid syntax (1263705030.py, line 4)

### Well done! Now you have more tools as part of your skillset!

You are also ready for this joke: *An SQL query walks into a bar and sees two tables. He walks up to them and says:*

<img src='https://cdn.dribbble.com/users/1463678/screenshots/3212815/tables-dribbble.png' width = 500px></img>

## Resources:
- [Introduction to Relational Databases in Python (DataCamp)](https://app.datacamp.com/learn/courses/introduction-to-relational-databases-in-python)
- [ORM For Python: SQLAlchemy 101](https://medium.com/@haataa/orm-for-python-sqlalchemy-101-with-code-example-60868e65b0c)
- [Read the docs](https://docs.sqlalchemy.org/en/14/orm/mapping_styles.html)
- [Tutorial FastAPI and working with databases](https://fastapi.tiangolo.com/tutorial/sql-databases/)
- [SQL query practice](https://www.sql-practice.com/)
- [SQL workshop](https://tdmdal.github.io/mma-sql/)